/*--------------------------------------------------------------------------*/
/**@file   pll_sof.h
   @brief  sof中断校准函数头文件
   @details
   @author
   @date   2012-2-18
   @note
*/
/*----------------------------------------------------------------------------*/
#ifndef _PLL_SOF_H_
#define _PLL_SOF_H_

				 
#ifdef __C51__

extern u8 memery_hprc_cnt[5];	 	///<矫正HPRC时钟暂存，读写矫正数时会用到
extern u8 xdata hprc_otp_cnt;	 	///<HPRC选用PLL数的组号
extern bool osc12m_online;			///<12M晶振校准在线标志

/*----------------------------------------------------------------------------*/
/**@brief   1ms sof中断，PC校准HPRC时钟，矫正中断计数函数
   @param   无
   @return  无
   @note    void sof_isr(void)
*/
/*----------------------------------------------------------------------------*/
void sof_isr(void);
/*----------------------------------------------------------------------------*/
/**@brief   开机时，从RAM或者EEPROM中读取PC矫正HPRC时钟矫正数函数
   @param   c:0,没有存储，1，已存储
   @return  无
   @note    void get_pll_sof(bool c)
*/
/*----------------------------------------------------------------------------*/
void get_pll_sof(bool c);
/*----------------------------------------------------------------------------*/
/**@brief   从机矫正HPRC时钟
   @param   无
   @return  3: 检测到12M时钟校准在线，不进行PC校准；
   			2：矫正不成功，退出从机校准，正常进入PC功能；
   			1：矫正成功，正常进入其他操作；
			0：矫正过程中，USB线拔出，矫正不成功；
   @note    u8 correct_hprc(void)
*/
/*----------------------------------------------------------------------------*/
u8 correct_hprc(void);

#endif


#endif 